Конфигурация отчетов/DataProcessors/РеализацияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РеализацияТовара</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПоследнегоНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/РеализацияТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
////*******************ВЗАИМОДЕЙТСВИЕ С ТЧ************************
//&НаСервере
//Процедура ТЧНоменклатураПриИзмененииНаСервере()
//	ТекСтрокаИд = Элементы.ТЧ.ТекущаяСтрока;
//	
//	ТекСтрокаТовары = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрокаИд);
//	ТекСтрокаТовары.ЕдиницаИзмирения = ТекСтрокаТовары.Номенклатура.ЕдиницаИзмирения;	
//	ТекСтрокаТовары.Цена = ПолучениеИнформации.ПолучитьЦену(ТекСтрокаТовары.Номенклатура);
//	ТекСтрокаТовары.Количество = 1;
//	ТекСтрокаТовары.Сумма = ТекСтрокаТовары.Цена * ТекСтрокаТовары.Количество;

//	
//	Записать();

//КонецПроцедуры

//&НаКлиенте
//Процедура ТЧНоменклатураПриИзменении(Элемент)      //ВЫБОР НОВОГО ТОВАРА
//	ТЧНоменклатураПриИзмененииНаСервере();
//КонецПроцедуры


//&НаСервере
//Процедура ТЧПриИзмененииНаСервере()
//	Товары = Объект.ТЧ;
//	Для Каждого ТМЦ Из Товары Цикл
//		ТМЦ.Сумма = ТМЦ.Цена * ТМЦ.Количество;
//	КонецЦикла;
//	Записать();
//	
//КонецПроцедуры

////&НаКлиенте
//Процедура ТЧПриИзменении(Элемент)      // перенести изминение количества и цены
//	ТЧПриИзмененииНаСервере();
//	ТекущийЭлемент = Элементы.ТЧ;
//	//проверка пустых строка
//	//ПроверкаПустыхСтрока();

//КонецПроцедуры

//&НаКлиенте
//Процедура ТЧШтрихКодПриИзменении(Элемент)     
//	Если ПолучитьДоступ() = Истина Тогда
//		ТекСтрокаИд = Элементы.ТЧ.ТекущаяСтрока;
//		
//		
//		ТекСтрокаТовары = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрокаИд);
//		
//		НайденыйТоварКод =  ПоискПоШтрихКоду(Число(Элемент.ТекстРедактирования));
//		
//		
//		
//		Если ПроверкаТовараВЧеке(НайденыйТоварКод, 1, ТекСтрокаИд, Истина) = Истина Тогда
//			Возврат;
//		КонецЕсли;
//		
//		ДобавитьТМЦбезСтрок(ТекСтрокаИд,НайденыйТоварКод);


//		ТЧНоменклатураПриИзмененииНаСервере();
//	КонецЕсли;
//КонецПроцедуры


////*****************ПРОВЕРКИ********************
////&НаСервере
////Процедура ПроверкаПустыхСтрока()

////	//Для Каждого Товар Из Объект.ТЧ Цикл
////	//	Если Товар.Номенклатура.Пустая() Тогда
////	//		УдалитьПустуюСтроку(Товар.НомерСтроки-1);
////	//	КонецЕсли;
////	//КонецЦикла;

////КонецПроцедуры // ПроверкаПустыхСтрока()


//&НаСервере
//Функция  ПроверкаЗаполненияПолей()
//	Для Каждого ТМЦ Из Объект.ТЧ Цикл
//		Если ТМЦ.Количество = 0 Тогда
//			Возврат Ложь;
//		ИначеЕсли ТМЦ.Цена = 0 Тогда
//			Возврат Ложь;
//		ИначеЕсли ТМЦ.Сумма = 0 Тогда
//			Возврат Ложь;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Истина;
//КонецФункции

//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	Если ПроверкаЗаполненияПолей() = Ложь Тогда
//		Сообщить("В документе присутствуют незаполненые поля!");
//		Отказ = Истина;
//	КонецЕсли;
//КонецПроцедуры


////******************ТЕХНИЧЕСКИЕ ФУКНЦИИ ПРОЦЕДУРЫ

//&НаСервере
//Функция ПоискПоШтрихКоду(ШтрихКод)

//	НайденыйТовар = Справочники.Номенклатура.НайтиПоРеквизиту("ШтрихКод",ШтрихКод);
//	
//	Возврат НайденыйТовар.Код;
//КонецФункции // ПоискПоШтрихКоду()

//&НаСервере
//Процедура ДобавитьТМЦбезСтрок(НомерСтрок,Код)

//	НайденыйТовар = Справочники.Номенклатура.НайтиПоКоду(Код);
//	
//	Для Каждого Товар Из Объект.ТЧ Цикл 
//		Если Товар.ПолучитьИдентификатор()=НомерСтрок Тогда
//			Товар.Номенклатура = НайденыйТовар;
//			Товар.Цена = ПолучениеИнформации.ПолучитьЦену(Товар.Номенклатура);
//			Товар.Количество = 1;
//			Товар.Сумма = Товар.Цена * Товар.Количество;
//			Товар.ОстатокТовара = ПолучениеИнформации.ПолучитьОстаток(НайденыйТовар);

//			Товар.ЕдиницаИзмирения = НайденыйТовар.ЕдиницаИзмирения;
//		КонецЕсли;
//	КонецЦикла;

//КонецПроцедуры // ДобавитьТМЦбезСтрок()


//&НаСервере
//Функция  ПроверкаТовараВЧеке(Код, Количество, ИДНаУдаление, Удалять = Ложь)

//	НайденыйТовар = Справочники.Номенклатура.НайтиПоКоду(Код);

//	Для Каждого Товар Из Объект.ТЧ Цикл 
//		
//		Если НайденыйТовар = Товар.Номенклатура Тогда
//			Товар.Количество = Товар.Количество + Количество;
//						//АктивизироватьПолеВвода();
//						
//			Если Удалять = Истина Тогда
//				УдалитьПустуюСтроку(РазмерЧека());
//			КонецЕсли;
//			
//			Возврат Истина;
//		КонецЕсли;
//	КонецЦикла;


//	Возврат Ложь;
//КонецФункции // ПроверкаТовараВЧеке()


//&НаСервере
//Функция РазмерЧека()

//	Возврат	Объект.ТЧ.Количество()-1;
//	
//КонецФункции // РазмерЧека()


//&НаСервере
//Функция ПолучитьДоступ()

//	Возврат Константы.РазрешитьПоиск.Получить();

//КонецФункции // ПолучитьДоступ()



//&НаСервере
//Процедура РассчитатьНаСервере()

//	Продажа = Документы.Продажи.СоздатьДокумент();
//	Продажа.Дата = Объект.Дата;
//	Продажа.СуммаПродажи = Объект.ТЧ.Итог("Сумма");
//	Для Каждого Товар Из Объект.ТЧ Цикл
//		Если Товар.Номенклатура.Пустая() = Ложь Тогда
//			Если Товар.Количество > 0 Тогда
//				ТМЦ = Продажа.ТЧ.Добавить();
//				ТМЦ.ТМЦ = Товар.Номенклатура;
//				ТМЦ.ЕдинициаИзмирения = Товар.ЕдиницаИзмирения;
//				ТМЦ.Количество = Товар.Количество;
//				ТМЦ.Цена = Товар.Цена;
//				ТМЦ.Сумма = Товар.Сумма;
//			КонецЕсли;
//			
//		КонецЕсли;
//	КонецЦикла;
//	
//	Продажа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
//	
//	Объект.ТЧ.Очистить();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Рассчитать(Команда)
//	РассчитатьНаСервере();
//	ТекущийЭлемент = Элементы.ТЧ;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтчетПоДню(Команда)
//	ПарамОтчета = Новый Структура;
//	ПарамОтчета.Вставить("НачалоПериода",ТекущаяДата());
//	ПарамОтчета.Вставить("КонецПериода",КонецДня(ТекущаяДата()));
//	ОткрытьФорму("Отчет.Продажи.Форма",ПарамОтчета);
//КонецПроцедуры

//&НаСервере
//Функция  ПолучитьНоменклатуру(Код)
//	
//	ТекТовар = Справочники.Номенклатура.НайтиПоКоду(Код);
//	
//	Возврат ТекТовар.Ссылка;

//КонецФункции // ПолучитьТМЦ()


//&НаСервере
//Процедура ДобавитьТМЦ(Код)
//	//проверка на наличие пустой строки
//	НайденыйТовар = Справочники.Номенклатура.НайтиПоКоду(Код);
//	
//	НовСтр = Объект.ТЧ.Добавить();
//	НовСтр.Номенклатура = НайденыйТовар;
//	НовСтр.Цена = ПолучениеИнформации.ПолучитьЦену(НовСтр.Номенклатура);
//	НовСтр.Количество = 1;
//	НовСтр.ШтрихКод = НовСтр.Номенклатура.ШтрихКод;

//	НовСтр.Сумма = НовСтр.Цена * НовСтр.Количество;
//	НовСтр.ОстатокТовара = ПолучениеИнформации.ПолучитьОстаток(НайденыйТовар);

//	НовСтр.ЕдиницаИзмирения = НайденыйТовар.ЕдиницаИзмирения;
//	//НовСтр.ШтрихКод = НайденыйТовар.ШтрихКод;

//КонецПроцедуры // ДобавитьТМЦ()

//&НаСервере
//Функция  ПроверкаГруппы(Код)
//	
//	ТекТовар = Справочники.Номенклатура.НайтиПоКоду(Код);
//	
//	Возврат ТекТовар.ЭтоГруппа; 
//	
//КонецФункции // ПолучитьТМЦ()

//&НаСервере
//Процедура УдалитьПустуюСтроку(ИД)

//	Объект.ТЧ.Удалить(ИД);
//	
//КонецПроцедуры // УУдалитьПустуюСтроку()



//&НаСервере
//Процедура ОбновитьНумерацию()
//	
//	//Объект.ТЧ.Выгрузить(
//	//ПорядковыйНомер = 0;
//	//Для Каждого Товар Из Объект.ТЧ Цикл
//	//	Товар.НомерСтроки = ПорядковыйНомер + 1;		
//	//КонецЦикла;

//КонецПроцедуры // ОбновитьНумерацию()




//&НаКлиенте
//Процедура КомандаДобавитьТовар(Команда)
//	//Если Объект.ТекущаяГруппа.Пустая() Тогда
//	//	Элементы.Назад.Доступность = Ложь;
//	//Иначе 
//	//	Элементы.Назад.Доступность = Истина;
//	//КонецЕсли;	
//	// сменить тек группу
//	Код = Число(СтрЗаменить(Команда.Имя,"Код",""));
//	ТоварГруппа = ПроверкаГруппы(Код);
//	НайдТовар = ПолучитьНоменклатуру(Код);
//	Если ТоварГруппа = Истина Тогда
//		ОчиститьПанельТоваров();

//		Объект.ТекущаяГруппа = НайдТовар;
//		НовыйВыводТоваров();
//	Иначе
//		//проверка на наличие товара в счете
//		Если ПроверкаТовараВЧеке(Код, 1, Неопределено) = Истина Тогда
//			ТЧПриИзмененииНаСервере();

//			Возврат;
//			

//		КонецЕсли;
//		//проверка на наличие пустой строки
//		
//		//изменить количество товара 
//		ДобавитьТМЦ(Число(СтрЗаменить(Команда.Имя,"Код","")));
//	КонецЕсли;
//	//ПроверкаПустыхСтрока();

//	ТекущийЭлемент = Элементы.ТЧ;
//	ТЧПриИзмененииНаСервере();

//КонецПроцедуры

//&НаКлиенте
//Процедура АктивироватьПоиск()
//	Если ТекущийЭлемент.Имя = Элементы.ПолеПоискаТовара.Имя Тогда
//		Возврат;
//	КонецЕсли;
//	ТекущийЭлемент = Элементы.ПолеПоискаТовара;

//КонецПроцедуры // АктивироватьПоиск()



//&НаСервере
//Функция  ГлобПоискПоШтрихКод()

//	  Возврат  ПолучениеИнформации.ПоискПоШтрихКоду(Формат(Объект.ПолеПоискаТовара,"ЧРГ=' '; ЧГ=0"));


//КонецФункции // ГлобПоискПоШтрихКод()

//&НаСервере
//Процедура ОчиститьПоиск()

//	Объект.ПолеПоискаТовара = 0;	

//КонецПроцедуры // ОчиститьПоиск()()


//&НаКлиенте
//Процедура ШтрихКодПоиск()
//	
//	КодТовара = ПоискПоШтрихКоду(Число(Объект.ПолеПоискаТовара));		//проверка на наличие товара в счете
//	Если ПроверкаТовараВЧеке(КодТовара, 1, Неопределено) = Истина Тогда
//		Возврат;
//	КонецЕсли;

//	//изменить количество товара 
//	ДобавитьТМЦ(КодТовара);
//	ОчиститьПоиск();
//	АктивироватьПоиск();	
//	//Элементы.ПолеПоискаТовара.АктивизироватьПоУмолчанию = Истина;
//КонецПроцедуры


//&НаСервере
//Процедура ОчиститьПанельТоваров()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Номенклатура.Код КАК Код,
//		|	Номенклатура.Наименование КАК Наименование,
//		|	Номенклатура.Родитель КАК Родитель
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.Родитель = &Родитель";
//	
//	Запрос.УстановитьПараметр("Родитель", Объект.ТекущаяГруппа);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		НайденнаяКоманда = Команды.Найти("Код"+Формат(Выборка.Код,"ЧГ=0"));
//		//Если НайденнаяКоманда <> Неопределено Тогда
//		Если НайденнаяКоманда = Неопределено Тогда
//			Продолжить;
//		КонецЕсли;
//		Команды.Удалить(НайденнаяКоманда);	
//		//КонецЕсли;
//	КонецЦикла;

//КонецПроцедуры // ОчиститьПанельТоваров()


//&НаСервере
//Процедура ДобавитьНаСервере(ИмяКоманды,ЗаголовоКоманды,Группа)
//	
//	//Добавление команды формы
//	Команда = Команды.Добавить(
//		ИмяКоманды); //Имя команды
//	Команда.Заголовок = ЗаголовоКоманды;
//	Команда.Действие  = "КомандаДобавитьТовар"; //Имя связанной процедуры
//	
//	//Полный перечень свойств команды в синтакс-помощнике
//	//	Интерфейс (управляемый)->Форма клиентского приложения->КомандаФормы
//	
//	//Добавление кнопки формы
//	КнопкаФормы = Элементы.Добавить(
//		"Кнопка"+ИмяКоманды, //Имя кнопки
//		Тип("КнопкаФормы"),             //Тип, всегда КнопкаФормы
//		Элементы.ГруппаВыборТовара);                      //Контейнер для кнопки (Форма, Группа, Командная панель)
//		
//	КнопкаФормы.ИмяКоманды = ИмяКоманды; //Связь с командой по имени
//	
//	//Возможные варианты вида кнопки:
//	//	-Гиперссылка
//	//	-ГиперссылкаКоманднойПанели
//	//	-КнопкаКоманднойПанели
//	//	-ОбычнаяКнопка
//	//Если контейнер для формы - командная панель
//	//то вид кнопки должен быть КнопкаКоманднойПанели
//	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
//	Если Группа = Истина Тогда
//		КнопкаФормы.ЦветФона = Метаданные.ЭлементыСтиля.ЦветКнопкиГруппы.Значение;
//	КонецЕсли;
//	//КнопкаФормы.ЦветФона.Зеленый = 236;
//	//КнопкаФормы.ЦветФона.Красный = 255;
//	//КнопкаФормы.ЦветФона.Синий = 139;
//	//КнопкаФормы.Шрифт
//	//КнопкаФормы.Ширина
//	//Полный перечень свойств кнопки формы в синтакс-помощнике
//	//	Интерфейс (управляемый)->Кнопка формы
//		
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаСервере
//Процедура ВыводТоваров()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Номенклатура.Родитель КАК Родитель,
//		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
//		|	Номенклатура.Код КАК Код,
//		|	Номенклатура.Наименование КАК Наименование
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.Родитель = &Родитель";
//	
//	Запрос.УстановитьПараметр("Родитель", Объект.ТекущаяГруппа);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		ДобавитьНаСервере("Код"+Строка(Выборка.Код),Выборка.Наименование,Выборка.ЭтоГруппа);
//	КонецЦикла;


//КонецПроцедуры // ВыводТоваров()


//&НаСервере
//Процедура НовыйВыводТоваров()
//	//ДобавитьНаСервере("Код"+Строка(Объект.ТекущаяГруппа.Код),Объект.ТекущаяГрупп.Наименование,Объект.ТекущаяГрупп.ЭтоГруппа);
//	
//	Элементы.ГруппаВыборТовара.Ширина = 70;
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Номенклатура.Родитель КАК Родитель,
//		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
//		|	Номенклатура.Код КАК Код,
//		|	Номенклатура.Наименование КАК Наименование,
//		|	Номенклатура.НазваниеЦенни КАК НазваниеЦенни,
//		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.Родитель = &Родитель
//		|	И Номенклатура.ПометкаУдаления = &ПометкаУдаления
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ЭтоГруппа УБЫВ,
//		|	Наименование";

//	
//	Запрос.УстановитьПараметр("Родитель", Объект.ТекущаяГруппа);
//	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);

//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	СчетчикЭлементовВГруппе = 0;   //итерация только для внутрених групп
//	ИндексТовара = 0;
//	ГлобальныйСчетчик = 0;  //по нему ориентируемся с какого номер начать выводить
//	НачалоВывод = ПолучитьДиапазон();  // стартовая цифра
//	Пока Выборка.Следующий() Цикл
//		ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
//		Если ГлобальныйСчетчик > НачалоВывод И ГлобальныйСчетчик < (НачалоВывод+25)Тогда 
//			ИндексТовара = ИндексТовара + 1;
//			СчетчикЭлементовВГруппе = СчетчикЭлементовВГруппе + 1;
//			//создаем группу
//			//индексируем фискированое количество
//			ИмяКоманды = "Код"+Строка(Формат(Выборка.Код,"ЧРГ=; ЧГ=0"));
//			Если Не ПустаяСтрока(Выборка.НазваниеЦенни) Тогда
//				ЗаголовоКоманды = Выборка.НазваниеЦенни;
//			Иначе
//				ЗаголовоКоманды = Выборка.Наименование;
//			КонецЕсли;	

//			Группа = Выборка.ЭтоГруппа;
//			
//			Команда = Команды.Добавить(
//				ИмяКоманды); //Имя команды
//			НовыйЗаголовой = Лев(ЗаголовоКоманды,13)+Символы.ПС+Сред(ЗаголовоКоманды,14,20);	
//			Команда.Заголовок = НовыйЗаголовой;
//			Команда.Действие  = "КомандаДобавитьТовар"; //Имя связанной процедуры
//			
//			//Полный перечень свойств команды в синтакс-помощнике
//			//	Интерфейс (управляемый)->Форма клиентского приложения->КомандаФормы
//			Если СчетчикЭлементовВГруппе < 5 Тогда 
//				ГруппаДляОтображения = Элементы.Группа0;
//			ИначеЕсли СчетчикЭлементовВГруппе > 4 И СчетчикЭлементовВГруппе < 9 Тогда 
//				ГруппаДляОтображения = Элементы.Группа2;
//			ИначеЕсли СчетчикЭлементовВГруппе > 8 И СчетчикЭлементовВГруппе < 13 Тогда 
//				ГруппаДляОтображения = Элементы.Группа3;
//			ИначеЕсли СчетчикЭлементовВГруппе > 12 И СчетчикЭлементовВГруппе < 17 Тогда 
//				ГруппаДляОтображения = Элементы.Группа4;
//			ИначеЕсли СчетчикЭлементовВГруппе > 16 И СчетчикЭлементовВГруппе < 21 Тогда 
//				ГруппаДляОтображения = Элементы.Группа5;
//			ИначеЕсли СчетчикЭлементовВГруппе > 20 И СчетчикЭлементовВГруппе < 25 Тогда 
//				ГруппаДляОтображения = Элементы.Группа6;
//		 	Иначе 
//				Объект.ИндексПоследнегоНомера = СчетчикЭлементовВГруппе; 
//				Прервать;
//			КонецЕсли; 
//			//Добавление кнопки формы
//			
//				КнопкаФормы = Элементы.Добавить(
//					"Кнопка"+ИмяКоманды, //Имя кнопки
//					Тип("КнопкаФормы"),             //Тип, всегда КнопкаФормы
//					ГруппаДляОтображения);                      //Контейнер для кнопки (Форма, Группа, Командная панель)
//				
//				КнопкаФормы.ИмяКоманды = ИмяКоманды; //Связь с командой по имени
//				КнопкаФормы.Высота = 3;
//				КнопкаФормы.Ширина = 18;
//				//Возможные варианты вида кнопки:
//				//	-Гиперссылка
//				//	-ГиперссылкаКоманднойПанели
//				//	-КнопкаКоманднойПанели
//				//	-ОбычнаяКнопка
//				//Если контейнер для формы - командная панель
//				//то вид кнопки должен быть КнопкаКоманднойПанели
//				КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
//				Если Группа = Истина Тогда
//					КнопкаФормы.ЦветФона = Метаданные.ЭлементыСтиля.ЦветКнопкиГруппы.Значение;
//					Объект.НомерСтраницы = 1;
//				КонецЕсли;	
//			КонецЕсли;
//		//ДобавитьНаСервере("Код"+Строка(Выборка.Код),Выборка.Наименование,Выборка.ЭтоГруппа);
//	КонецЦикла;

//КонецПроцедуры // ВыводТоваров()


//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	НовыйВыводТоваров();
//	Объект.НомерСтраницы = 1;
//	//АктивироватьПоиск();
//	//Если Объект.ТекущаяГруппа.Пустая() Тогда
//	//	Элементы.Назад.Доступность = Ложь;
//	//Иначе 
//	//	Элементы.Назад.Доступность = Истина;
//	//КонецЕсли;	
//КонецПроцедуры


//&НаСервере
//Функция УстановкаРодителяГруппы()

//	Объект.ТекущаяГруппа = Объект.ТекущаяГруппа.Родитель;
//	
//КонецФункции // ПолучитьРодителяГруппы()


//&НаКлиенте
//Процедура Назад(Команда)
//	ОчиститьПанельТоваров();
//	Объект.НомерСтраницы = 1;

//	УстановкаРодителяГруппы();
//	НовыйВыводТоваров();

//КонецПроцедуры

//&НаКлиенте
//Процедура CледущаяСтраница(Команда)
//	КолТовараВГруппе =КоличествоСтраниц();
//	Если КолТовараВГруппе < Объект.НомерСтраницы + 1 Тогда
//		Возврат;
//	КонецЕсли;
//	ОчиститьПанельТоваров();
//	Объект.НомерСтраницы = Объект.НомерСтраницы + 1;
//	НовыйВыводТоваров();
//КонецПроцедуры

//&НаКлиенте
//Процедура ПредыдущаяСтраница(Команда)
//	Если Объект.НомерСтраницы = 1 Тогда
//		Возврат;
//	КонецЕсли;
//	ОчиститьПанельТоваров();

//	Объект.НомерСтраницы = Объект.НомерСтраницы - 1;
//	НовыйВыводТоваров();

//КонецПроцедуры


//&НаСервере
//Функция ПолучитьДиапазон()

//	Если Объект.НомерСтраницы = 1 Тогда
//		Возврат 0;	
//	ИначеЕсли Объект.НомерСтраницы = 2 Тогда
//		Возврат 24;		
//	ИначеЕсли Объект.НомерСтраницы = 3 Тогда
//		Возврат 48;	
//	ИначеЕсли Объект.НомерСтраницы = 4 Тогда
//		Возврат 74;	
//	ИначеЕсли Объект.НомерСтраницы = 5 Тогда
//		Возврат 98;	
//	ИначеЕсли Объект.НомерСтраницы = 6 Тогда
//		Возврат 122;	
//	ИначеЕсли Объект.НомерСтраницы = 7 Тогда
//		Возврат 146;	
//	ИначеЕсли Объект.НомерСтраницы = 8 Тогда
//		Возврат 169;	
//	ИначеЕсли Объект.НомерСтраницы = 9 Тогда
//		Возврат 194;	
//	ИначеЕсли Объект.НомерСтраницы = 10 Тогда
//		Возврат 218;	
//	ИначеЕсли Объект.НомерСтраницы = 11 Тогда
//		Возврат 242;	
//	ИначеЕсли Объект.НомерСтраницы = 12 Тогда
//		Возврат 266;	
//	ИначеЕсли Объект.НомерСтраницы = 13 Тогда
//		Возврат 290;	
//	ИначеЕсли Объект.НомерСтраницы = 14 Тогда
//		Возврат 314;	
//	ИначеЕсли Объект.НомерСтраницы = 15 Тогда
//		Возврат 338;	
//	ИначеЕсли Объект.НомерСтраницы = 16 Тогда
//		Возврат 362;	
//	КонецЕсли;	
//	
//	Возврат 0;
//КонецФункции // ПолучитьДиапазон()


//&НаСервере
//Функция КоличествоСтраниц()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Номенклатура.Код КАК Код
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.Родитель = &Родитель";
//	
//	Запрос.УстановитьПараметр("Родитель", Объект.ТекущаяГруппа);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	КолТовара = 0;
//	Пока Выборка.Следующий() Цикл
//		КолТовара = КолТовара + 1;
//	КонецЦикла;
//	
//	Возврат Окр(КолТовара/24,0,0)+1;

//КонецФункции // КоличествоСтраниц()


//&НаКлиенте
//Процедура ЗавершитьРаботу(Команда)
//	ЗавершитьРаботуСистемы(Ложь); 
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьЦеныНаСервере()
//	//Продажа = Документы.Переоценка.СоздатьДокумент();
//	//Продажа.Дата = Объект.Дата;
//	//
//	//Для Каждого Товар Из Объект.ТЧ Цикл
//	//	ТМЦ = Продажа.ТЧ.Добавить();
//	//	ТМЦ.Номенклатура = Товар.Номенклатура;
//	//	ТМЦ.Цена = Товар.Цена;
//	//КонецЦикла;
//	//
//	//Продажа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
//	//
//	//Объект.ТЧ.Очистить();
//	Продажа = Документы.ПриходТовара.СоздатьДокумент();
//	Продажа.Дата = Объект.Дата;
//	Продажа.Склад = Константы.СкладПоУмолчанию.Получить();
//	Продажа.Контрагент = Константы.КонтрагентПоУмолчанию.Получить();
//	Для Каждого Товар Из Объект.ТЧ Цикл
//		ТМЦ = Продажа.ТЧ.Добавить();
//		ТМЦ.Номенклатура = Товар.Номенклатура;
//		ТМЦ.ЦенаНаПродажу = Товар.Цена;
//		ТМЦ.Количество = Товар.Количество;
//	КонецЦикла;
//	
//	Продажа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
//	
//	Объект.ТЧ.Очистить();


//КонецПроцедуры


//&НаСервере
//Процедура ЗаполнитьГрупп()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Номенклатура.Родитель КАК Родитель,
//		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
//		|	Номенклатура.Ссылка КАК Ссылка,
//		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.Родитель = &Родитель
//		|	И Номенклатура.ПометкаУдаления = &ПометкаУдаления
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Номенклатура.Наименование,
//		|	Номенклатура.НазваниеЦенни
//		|АВТОУПОРЯДОЧИВАНИЕ";
//	
//	Запрос.УстановитьПараметр("Родитель", Объект.ТекущаяГруппа);
//	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		ТекЦена = ПолучениеИнформации.ПолучитьЦену(Выборка.Ссылка);  
//		//Если ТекЦена = Неопределено Тогда
//			Если Выборка.ЭтоГруппа = Ложь ТОгда
//				ТМЦ = Объект.ТЧ.Добавить();
//				ТМЦ.Номенклатура = Выборка.Ссылка;
//				ТМЦ.Цена = ТекЦена;
//				ТМЦ.ШтрихКод = ТМЦ.Номенклатура.ШтрихКод;
//				ТМЦ.ОстатокТовара = ПолучениеИнформации.ПолучитьОстаток(ТМЦ.Номенклатура);
//			КонецЕсли;
//		//КонецЕсли;
//	КонецЦикла;

//КонецПроцедуры // ЗаполнитьГрупп()


//&НаСервере
//Процедура СохранитьШтрихКода()       // это должно уйти в отдельную обработку

//	Для каждого Товар Из Объект.ТЧ Цикл
//		Если Товар.ШтрихКод<>0 Тогда
// 			ТекТовар = Справочники.Номенклатура.НайтиПоКоду(Товар.Номенклатура.Код);
//			
//			НайдТовар = ТекТовар.ПолучитьОбъект();
//			НайдТовар.ШтрихКод = Товар.ШтрихКод;
//			НайдТовар.Записать();
//		КонецЕсли;
//	КонецЦикла;

//КонецПроцедуры // СохранитьШтрихКода()


//&НаКлиенте
//Процедура УстановитьЦены(Команда)        // это должно уйти в отдельную обработку

//	//УстановитьЦеныНаСервере();
//	СохранитьШтрихКода();
//КонецПроцедуры

//&НаКлиенте
//Процедура Заполнить(Команда)
//	
//	ЗаполнитьГрупп();
//		
//КонецПроцедуры

//&НаСервере
//Процедура УдалитьНаСервере()
//	Объект.ТЧ.Очистить();
//КонецПроцедуры

//&НаКлиенте
//Процедура Удалить(Команда)
//	УдалитьНаСервере();
//КонецПроцедуры

&НаСервере
Функция ОбработкаПоискаТовара()

	НайденныйТовар = Справочники.Номенклатура.НайтиНоменклатуруПоШтрихКоду(Объект.ПолеПоискаТовара);
	Если НайденныйТовар = Неопределено ИЛИ ЗначениеЗаполнено(НайденныйТовар)=Ложь Тогда
		НайденныйТовар = Справочники.Номенклатура.НайтиНоменклатуруПоКоду(Объект.ПолеПоискаТовара);
        Если НайденныйТовар = Неопределено ИЛИ ЗначениеЗаполнено(НайденныйТовар)=Ложь Тогда 
			Возврат Ложь;     
		КонецЕсли;
	КонецЕсли;
	
	НовыйТовар = Объект.ТЧ.Добавить();
	НовыйТовар.ШтрихКод = Объект.ПолеПоискаТовара;
	НовыйТовар.Номенклатура = НайденныйТовар;
	НовыйТовар.Цена = Справочники.Номенклатура.ПолучитьЦенуТовара(НайденныйТовар);	
КонецФункции // ОбработкаПоискаТовара()


&НаКлиенте
Процедура ПолеПоискаТовараПриИзменении(Элемент)
	ОбработкаПоискаТовара();
		//ШтрихКодПоиск();
КонецПроцедуры

//&НаКлиенте
//Процедура ПолеПоискаТовараОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	АктивироватьПоиск();
//КонецПроцедуры

//&НаСервере
//Функция  НачатьНаСервере()
//	ТекущийЭлемент = Элементы.ТЧ;
//		
//КонецФункции

//&НаКлиенте
//Процедура Начать(Команда)
//	НачатьНаСервере();
//КонецПроцедуры         


#Область ОбработкаСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры



#КонецОбласти
